import {
    Box,
    Container,
    Flex,
    Heading,
    Stack,
    Text
} from '@chakra-ui/react';
import React from 'react';
import WithSubnavigation from '../LibarayHeader/LibararyHeader';
import CaptionCarousel from '../LibararyCarasoul/LibararyCarasoul';
import LargeWithNewsletter from '../LibraryFooter/LibarayFooter';


const LibraryStrategicPlan = () => {
    return (
        <>
            <WithSubnavigation />
            <CaptionCarousel />
            <Box p={4}>
                <Stack spacing={4} as={Container} maxW={'3xl'} textAlign={'center'}>
                    <Heading fontSize={{ base: 'xl', sm: '3xl' }} fontWeight={'bold'}>
                        الخطة الاستراتيجية للمكتبة
                    </Heading>

                </Stack>
                <Container maxW={'5xl'} mt={12} textAlign={"right"}>
                    <div >
                        يعد التخطيط الاستراتيجي من العمليات التي لا يمكن الاستغناء عنها في وقتنا الحالي الذي يميزه التأثير القوي والمتزايد للبيئة في المكتبات  في أنحاء العالم . فلقد أصبحت المكتبات اليوم ملزمة بتحسين مستوى أدائها من أجل رفع مستوى مخرجاتها وتقديم خدمات بكفاءة عالية؛ ولا يمكن للمكتبات تحقيق هذه الأهداف إلا بالتحكم في مسيرتها ورسم مستقبلها بالطريقة التي تخدم آمالها وطموحاتها. ويعد التخطيط الاستراتيجي الوسيلة الأنسب التي يمكن الاعتماد عليها من أجل تحديد الوضع المستقبلي المرغوب وحصر وتعبئة الموارد الضرورية للوصول إلى ذلك الوضع.
                    </div>
                    <div>
                        <h1>تمهيد</h1>
                        يعطي التخطيط الاستراتيجي نظرة شاملة عما تقوم به المكتبة وإلى أين تتجه. كما يسلط الضوء على ما تريد أن تقوم به المكتبة  والكيفية التي ستعملها للوصل إلى ما تريد الوصول إليه.
                        يساعد التخطيط الاستراتيجي على الإجابة على أكبر وأهم الأسئلة التي تطرحها المنظمات يوميا، كما يساعدها أيضا على التحكم في مسيرتها وممارساتها.
                        وتختلف المقاربات الاستراتيجية وبهذا تختلف ممارسات التخطيط الاستراتيجي أيضا، ومهما كانت الممارسة التي نختارها فهناك مجموعة من القيود التي لا يمكن إغفالها أو عدم احترامها لأن كل الممارسات تشير إلى أهمية احترامها.
                    </div>
                    <div pd={"15px"}>
                        <h1>1-	مراحل التخطيط الاستراتيجي </h1>
                        تختلف مراحل عملية التخطيط الاستراتيجي باختلاف المقاربات التي يبنى عليه التفكير الاستراتيجي نفسه.
                        <br />
                        و تتم عملية التخطيط الاستراتيجي في المراحل التالية :
                        <br />
                        أولا – تحليل بيئة المكتبة
                        <br />
                        ثانيا – تحديد هوية المكتبة
                        <br />
                        ثالثا -  تحديد الخيارات الاستراتيجية
                        <br />
                        رابعا – تحديد الأهداف الاستراتيجية
                    </div>
                    <div>
                        <h1>أولا – تحليل بيئة الكلية (أو العمادة أو المركز)</h1>
                        تم إعداد الخطة الاستراتيجية بتحليل بيئة المكتبة وذلك في أربع خطوات رئيسية تبدأ بتحليل البيئة لتنتهي إلى المقارنة المرجعية.
                    </div>
                    <div>
                        <h1>1-	تحليل البيئة الداخلية:</h1>
                        يختلف نوع البيانات التي تجمع في هذه المرحلة باختلاف نشاط وحجم ووضع الوحدة التي يتم لها وضع الخطة الاستراتيجية غير أن البيانات الت تجمع هي تلك التي لها علاقة بمهنة الوحدة نفسها  .
                    </div>
                    <div>
                        فمثلا، بالنسبة لكلية ومن بين البيانات التي تطلب ما يلي :
                        <br />
                        فيما يخص عدد المستفيدين من المكتبة  :
                        <br />
                        عدد الطلبة في كل برنامج داخل الكلية
                        <br />
                        نسبة الخريجين إلى عدد الطلبة الإجمالي
                        <br />
                        نسبة عضو هيئة التدريس إلى الطلبة الواردين للمكتبة
                        <br />
                        نسبة الطلبة الزائرين للمكتبة
                        <br />
                        بالنسبة لبيئة العمل:
                        <br />
                        مستوى رضا العاملين بالمكتبة من البيئة الأكبر وهى الكلية
                        <br />
                        مستوى رضا الطلبة عن الخدمات التي تقدمها المكتبة
                        <br />
                        مستوى رضا الطلبة عن الأنشطة فى مكتبة الكلية
                        <br />
                        مستوى رضا أعضاء هيئة التدريس عن جو العمل بالكلية
                        <br />
                        بالنسبة للإدارة
                        <br />
                        طبيعة القيادة بإدارة المكتبة
                        <br />
                        مستوى رضا الموظفين عن العمل بالمكتبة
                        <br />
                        طبيعة الاتصال السائد في المكتبة
                        <br />
                        وتم عمل استبيان ومقابلات
                        <br />
                        في هذا الصدد يمكن توزيع استبيان لكل شريك من الشركاء الداخليين للكلية (طلبة، أعضاء هيئة التدريس، الموظفون، ...) وتجرى مقابلات مع مسؤولي الكلية ومع بعض أعضاء هيئة التدريس وبعض الطلبة والموظفين أيضا. أما الملاحظة فيمكن اللجوء إليها عند الحاجة إلى الحصول على بيانات إضافية.

                    </div>

                </Container>
            </Box>
            <LargeWithNewsletter />
        </>
    );
}

export default LibraryStrategicPlan;